app/views/pessoas/_form.html.erb

    <%= f.label :ficha %><br>
    <%= f.select :ficha_id, @fichas.collect { |a| [a.ficha, a.id]} %>
---
SELECT `fichas`.* FROM `fichas`