app/views/ocupacaos/show.html.erb

SELECT COUNT(*) FROM `pessoas` WHERE `pessoas`.`ocupacao_id` = 1
---
  <strong>Quantidade:</strong>
 <%= pluralize @ocupacao.pessoas.size, "pessoa" %>