app/views/fichas/show.html.erb

SELECT COUNT(*) FROM `pessoas` WHERE `pessoas`.`ficha_id` = 1
---
  <strong>Total de Pessoas na Família:</strong>
 <%= @ficha.pessoas.count %></b>