app/controllers/fichas_controller.rb

SELECT `fichas`.* FROM `fichas`
---
  def index
    @fichas = Ficha.all

INSERT INTO `fichas` (`abastecimento_agua`, `area`, `bairro`, `caso_doenca`, `cep`, `comodos`, `created_at`, `data`, `destino_fezes_urina`, `destino_lixo`, `endereco`, `energia_eletrica`, `meio_comunicacao`, `microarea`, `municipio`, `nome_plano`, `numero`, `participa_cooperativa`, `participa_grupo_religioso`, `plano_saude`, `segmento`, `tipocasa`, `transporte`, `tratamento_agua`, `updated_at`) VALUES ('Sim', 444, 'Mocambinho', '', 64055900, 4, '2013-11-02 18:19:12', '2013-11-02', 'fossa', 'aterro', 'Rua imperador', 'Sim', '', 123, 'Teresina', '', 4643, 'Sim', 'Sim', 'Não', 23, 'Tijolo', '', 'Sim', '2013-11-02 18:19:12')
---
  def create
    @ficha = Ficha.new(ficha_params)

    respond_to do |format|
      if @ficha.save

UPDATE `fichas` SET `endereco` = 'Rua Cunhão de Boi', `numero` = '12323', `bairro` = '', `cep` = '', `municipio` = '', `tipo_casa` = '', `energia_eletrica` = '', `destino_lixo` = '', `tratamento_agua` = '', `abastecimento_agua` = '', `destino_fezes` = '', `data` = '2013-12-03', `updated_at` = '2013-12-03 22:41:56' WHERE `fichas`.`id` = 1
---
  def update
    respond_to do |format|
      if @ficha.update(ficha_params)

SELECT `fichas`.* FROM `fichas` WHERE `fichas`.`id` = 1 LIMIT 1
---
    def set_ficha
      @ficha = Ficha.find(params[:id])