app/controllers/pessoas_controller.rb

SELECT `pessoas`.* FROM `pessoas`
---
  def index
    @pessoas = Pessoa.all

SELECT `pessoas`.* FROM `pessoas` WHERE `pessoas`.`id` = 1 LIMIT 1
---
  def show
    @pessoas = Pessoa.find(params[:id])

SELECT `ocupacaos`.* FROM `ocupacaos`
SELECT `fichas`.* FROM `fichas`
---
  def new
    @pessoa = Pessoa.new
    @ocupacaos = Ocupacao.all
    @fichas = Ficha.all

SELECT `pessoas`.* FROM `pessoas` WHERE `pessoas`.`id` = 1 LIMIT 1
---
  def edit
    @pessoa = Pessoa.find(params[:id])

INSERT INTO `pessoas` (`created_at`, `updated_at`) VALUES ('2013-11-07 20:19:54', '2013-11-07 20:19:54')
---
  def create
    @pessoa = Pessoa.new(pessoa_params)
    assigned_doencas = Doenca.find(params[:pessoa][doencas]) rescue []
    @pessoa.doencas = assigned_doencas
    respond_to do |format|
      if @pessoa.save

DELETE FROM `pessoas` WHERE `pessoas`.`id` = 1
---
  def destroy
    @pessoa.destroy

SELECT `pessoas`.* FROM `pessoas` WHERE `pessoas`.`id` = 1 LIMIT 1
---
    def set_pessoa
      @pessoa = Pessoa.find(params[:id])